In [1]:
import pandas

In [2]:
df1 = pandas.DataFrame

In [3]:
df1

pandas.core.frame.DataFrame

In [4]:
df1 = pandas.DataFrame([['2','4','6'],['8','10','12']])

In [5]:
df1

   0   1   2
0  2   4   6
1  8  10  12

In [6]:
df1 = pandas.DataFrame([['2','4','6'],['8','10','12']],columns=['Price','Age','Value'])

In [7]:
df1

  Price Age Value
0     2   4     6
1     8  10    12

In [8]:
df1 = pandas.DataFrame([['2','4','6'],['8','10','12']],columns=['Price','Age','Value'], index=['First','Second'])

In [9]:
df1

       Price Age Value
First      2   4     6
Second     8  10    12

In [10]:
df2 = pandas.DataFrame([{"name":"John"},{"name":"Jack"}])

In [11]:
df2

   name
0  John
1  Jack

In [12]:
df2 = pandas.DataFrame([{"name":"John",'surname':'Jones'},{"name":"Jack"}])
df2

   name surname
0  John   Jones
1  Jack     NaN

In [13]:
df1
type(df1)

pandas.core.frame.DataFrame

In [14]:
df1.mean()

Price     14.0
Age      205.0
Value    306.0
dtype: float64

In [15]:
df1.mean().mean()

175.0

In [16]:
df1.Price.mean()

14.0

In [17]:
df1.Price.max()

'8'